
const MenuList = {
	"showapi_res_error": "",
	"showapi_res_id": "48f560e51b8249af8e8b907454be9a48",
	"showapi_res_code": 0,
	"showapi_res_body": {
		"allNum": 83926,
		"allPage": 4197,
		"datas": [
			{
				"cpName": "洋槐花麦饭",
				"ct": "2019-12-07 23:32:50.899",
				"des": "从小到大，每年春天都会吃到妈妈做的洋槐花麦饭，可是今年那会工作忙一直没回老家，就错过了花期，于是我从春天念叨到了冬天：遗憾没吃到今年的洋槐花…可前几天忽然看到某星球在卖“冷藏槐花，果断买了一点回来解解馋，打包到公司，同事也都夸好吃呢…满足…",
				"id": "5debc622e9b6cc6913703097",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/2642555d-f97d-4e0c-b612-a2e333977fb3.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/8c0fbb35-1ab8-4ea8-9e89-61d488f13fb7.jpg",
				"steps": [
					{
						"content": "槐花解冻，洗净，擦干水分。因为我买的是冷藏的槐花，所以放了会进行解冻…",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/4fcfc1bf-d037-4207-a90a-35609db0b9d6.jpg",
						"orderNum": 1
					},
					{
						"content": "将面粉与槐花拌和。喜欢槐花散一点的，就在上步擦干点。面粉根据喜好看着放，我也不清楚自己放了多少…",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/68e10415-95f0-4266-85c2-04c0c92caae2.jpg",
						"orderNum": 2
					},
					{
						"content": "和好之后，放置在蒸笼上，一定要放置一块干净的蒸布，妈妈都是这么做的，可能是怕槐花从孔上掉下去吧，也可能是吸收水分的…",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/ce92b041-29c6-43df-8d53-95f265f34ca2.jpg",
						"orderNum": 3
					},
					{
						"content": "铺好就是这样…开蒸…电饭锅蒸了30分钟…满屋子都是熟悉的味道…槐花蒸的时候，可以准备料汁，蒜切丁，辣椒切丁醋盐/生抽香油备用，把蒜味辣椒味腌制出来…",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/1eafa7cb-4fe6-467e-b06e-4aac363adb4c.jpg",
						"orderNum": 4
					},
					{
						"content": "出锅后就是这样…用筷子打散放进碗里，加入料汁，撒上干辣椒面，起锅烧油，浇到辣椒面上…搅拌均匀，来吃…好幸福啊…",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/95102dc3-0ab8-4c52-a0fd-f5845547b1f4.jpg",
						"orderNum": 5
					}
				],
				"tip": "",
				"type": "蔬菜水果 花朵植物类 槐花",
				"type_v1": "蔬菜水果",
				"type_v2": "花朵植物类",
				"type_v3": "槐花",
				"yl": [
					{
						"ylName": "槐花",
						"ylUnit": "250克"
					},
					{
						"ylName": "面粉",
						"ylUnit": "看喜好"
					},
					{
						"ylName": "蒜",
						"ylUnit": "3瓣"
					},
					{
						"ylName": "🌶️",
						"ylUnit": "2颗"
					},
					{
						"ylName": "盐",
						"ylUnit": "少许"
					},
					{
						"ylName": "醋",
						"ylUnit": "2勺"
					},
					{
						"ylName": "辣椒面",
						"ylUnit": "1-2勺"
					},
					{
						"ylName": "香油",
						"ylUnit": "1-2滴"
					},
					{
						"ylName": "油",
						"ylUnit": "2-3勺"
					}
				]
			},
			{
				"cpName": "黄瓜薄荷伏特加，清新爽口",
				"ct": "2019-12-07 23:32:25.036",
				"des": "非常适合夏日的一款口感清新特别的鸡尾酒，用了自己种的现摘薄荷，味道极其浓郁",
				"id": "5debc609e9b6cc6913703096",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/1c6bf274-fef4-4895-8af5-5444f7052794.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/f1083fc2-6e76-4ffd-ba17-400749ff8ca3.jpg",
				"steps": [
					{
						"content": "薄荷叶捣碎，垫在杯低，压上冰块和切片黄瓜",
						"imgUrl": "",
						"orderNum": 1
					},
					{
						"content": "两分伏特加、少许柠檬汁，半分糖浆混合，摇匀倒入杯中",
						"imgUrl": "",
						"orderNum": 2
					},
					{
						"content": "加入苏打水，点缀一点薄荷叶",
						"imgUrl": "",
						"orderNum": 3
					}
				],
				"tip": "柠檬汁一定不能多，否则太酸会失去口感的平衡，糖浆根据个人喜好来把握分量",
				"type": "蔬菜水果 花朵植物类 薄荷",
				"type_v1": "蔬菜水果",
				"type_v2": "花朵植物类",
				"type_v3": "薄荷",
				"yl": [
					{
						"ylName": "伏特加",
						"ylUnit": "两冰格"
					},
					{
						"ylName": "苏打水",
						"ylUnit": "1/3罐"
					},
					{
						"ylName": "薄荷叶",
						"ylUnit": ""
					},
					{
						"ylName": "黄瓜",
						"ylUnit": ""
					},
					{
						"ylName": "枫糖浆",
						"ylUnit": ""
					},
					{
						"ylName": "柠檬汁",
						"ylUnit": "少许"
					},
					{
						"ylName": "冰块",
						"ylUnit": ""
					}
				]
			},
			{
				"cpName": "薄荷巧克力芝士蛋糕",
				"ct": "2019-12-07 23:32:24.732",
				"des": "浓情满满的巧克力配上清凉的薄荷小清新十足本菜谱出自——《爱上低脂甜品》可做一个八寸蛋糕",
				"id": "5debc608e9b6cc6913703095",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/9c1d1334-f386-4008-b78c-58e9386997ed.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/baf96bc8-fbed-489c-843d-2bf531642ddc.jpg",
				"steps": [
					{
						"content": "将蛋黄和糖1打至糖融化。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/f073544c-074d-464e-b316-462a8aa5b7b6.jpg",
						"orderNum": 1
					},
					{
						"content": "加入牛奶和融化的黄油，拌匀。再筛入低筋面粉和可可粉，拌匀。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/31adcff1-7e70-498d-986a-3d04a7c5a46b.jpg",
						"orderNum": 2
					},
					{
						"content": "蛋白中分次加入糖2，打发至湿性发泡。呈鸟喙状。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/b1309d3f-0c1f-41a7-97bf-c75bde9c8d5b.jpg",
						"orderNum": 3
					},
					{
						"content": "取三分之一的甜蛋白糊到至面糊中，搅拌均匀。再将剩余的加入面糊中拌匀。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/cceb15db-9376-46f2-938d-71033d8a2368.jpg",
						"orderNum": 4
					},
					{
						"content": "面糊倒进烤模内，以180烤25分钟即可。烤。",
						"imgUrl": "",
						"orderNum": 5
					},
					{
						"content": "将奶油奶酪加糖拌匀。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/e2a7d42d-b751-4fc8-8a9e-a65e2665aeae.jpg",
						"orderNum": 6
					},
					{
						"content": "分鸡，拌匀（拌匀）。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/1721d218-abce-476b-a134-6492a4f8ead8.jpg",
						"orderNum": 7
					},
					{
						"content": "加入淡奶油和薄荷糖浆搅拌均匀即可。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/c402a320-03d0-44fa-8ee6-ebbe2450e144.jpg",
						"orderNum": 8
					},
					{
						"content": "倒入已冷却的朱古力蛋糕的烤模内，以160隔水烤50分钟即可。",
						"imgUrl": "",
						"orderNum": 9
					},
					{
						"content": "为了凸显薄荷味我用了两款薄荷糖浆都是莫林的",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/25eb7103-cb57-4913-89f9-720b64a4c62b.jpg",
						"orderNum": 10
					}
				],
				"tip": "1.把芝士糊倒入模具后，要把表面的气泡用牙签戳破，不然烤完后会丑丑的。2.在隔水烤的时候，最后二十分钟左右加盖锡纸，不然就会黑顶啦。",
				"type": "蔬菜水果 花朵植物类 薄荷",
				"type_v1": "蔬菜水果",
				"type_v2": "花朵植物类",
				"type_v3": "薄荷",
				"yl": [
					{
						"ylName": "＃朱古力蛋糕＃",
						"ylUnit": ""
					},
					{
						"ylName": "蛋黄",
						"ylUnit": "3个"
					},
					{
						"ylName": "糖1",
						"ylUnit": "30g"
					},
					{
						"ylName": "低筋面粉",
						"ylUnit": "60g"
					},
					{
						"ylName": "可可粉",
						"ylUnit": "20g"
					},
					{
						"ylName": "黄油（融化）",
						"ylUnit": "60g（原方40g）"
					},
					{
						"ylName": "牛奶",
						"ylUnit": "20ml"
					},
					{
						"ylName": "蛋白",
						"ylUnit": "3个"
					},
					{
						"ylName": "糖2",
						"ylUnit": "30g"
					},
					{
						"ylName": "＃薄荷芝士年糕＃",
						"ylUnit": ""
					},
					{
						"ylName": "奶油奶酪",
						"ylUnit": "250g"
					},
					{
						"ylName": "糖",
						"ylUnit": "30g"
					},
					{
						"ylName": "蛋",
						"ylUnit": "3个"
					},
					{
						"ylName": "淡奶油",
						"ylUnit": "50g"
					},
					{
						"ylName": "薄荷糖浆",
						"ylUnit": "2tbsp（原方1tbsp）"
					}
				]
			},
			{
				"cpName": "南大门桂花糕",
				"ct": "2019-12-07 23:32:07.435",
				"des": "",
				"id": "5debc5f7e9b6cc6913703094",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/1b1cb661-8df9-435c-8b7c-19236d912700.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/372893ff-d3d3-4331-a126-0604e709c926.jpg",
				"steps": [
					{
						"content": "全部工具",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/40e5a161-afa5-4d94-96f2-404759a3ab25.jpg",
						"orderNum": 1
					},
					{
						"content": "这种也可以用，淘宝可以买",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/8d83176e-49ff-4669-8b9d-8f4a917ba62e.jpg",
						"orderNum": 2
					},
					{
						"content": "全部原材料搅拌均匀。（配方里的水只是参考，因为是现磨大米粉，所以吸水量不一样，抓把粉捏一下如视频中的状态即可，粉不宜过干，不然影响口感，吃起来会很散。）",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/99b8ee66-40f2-4e44-ae8c-a44618f136af.jpg",
						"orderNum": 3
					},
					{
						"content": "用筛网过滤一次。（筛网2030目，筛网，口感比较腻，筛网，比较有颗粒感，根据个人喜好。）",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/4f2585d0-a1eb-48c4-af85-4702ff151f67.jpg",
						"orderNum": 4
					},
					{
						"content": "将粉再次倒入筛网中，用手掌按压，过滤模具内。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/49dd4afa-5c60-495f-8564-c65767e01776.jpg",
						"orderNum": 5
					},
					{
						"content": "用刮板刮平，模具内不能按压。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/923c85a1-3052-47c9-b7e3-22cb7ae916f9.jpg",
						"orderNum": 6
					},
					{
						"content": "可以用长尺，美工刀切出想要的尺寸即可。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/cd6689e8-db5b-4e89-967c-ed43d8d02e28.jpg",
						"orderNum": 7
					},
					{
						"content": "这是定制模具，淘宝没有卖，可以搜方形蒸笼、方形蛋糕模具。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/ca0f15f3-d017-47c5-ad11-c8e4bfb0ee6f.jpg",
						"orderNum": 8
					},
					{
						"content": "因为忘记买糖桂花，只能干桂花代替一下。蒸15分钟。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/c20aeb7a-7de1-47c9-a860-bea99f071d5d.jpg",
						"orderNum": 9
					},
					{
						"content": "我用的是蜂蜜，应该用糖桂花。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/34e37fa9-5036-45c8-8fd2-72740b807b8a.jpg",
						"orderNum": 10
					},
					{
						"content": "完成",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/e670ae92-3721-484c-b503-7d8f2fb8fa47.jpg",
						"orderNum": 11
					}
				],
				"tip": "",
				"type": "蔬菜水果 花朵植物类 桂花",
				"type_v1": "蔬菜水果",
				"type_v2": "花朵植物类",
				"type_v3": "桂花",
				"yl": [
					{
						"ylName": "现磨大米粉（粳米粉）",
						"ylUnit": "350克"
					},
					{
						"ylName": "糯米粉",
						"ylUnit": "60克"
					},
					{
						"ylName": "绵白糖",
						"ylUnit": "100克"
					},
					{
						"ylName": "水",
						"ylUnit": "90克"
					},
					{
						"ylName": "糖桂花",
						"ylUnit": ""
					}
				]
			},
			{
				"cpName": "翅根榛蘑粉",
				"ct": "2019-12-07 23:31:06.945",
				"des": "",
				"id": "5debc5bae9b6cc6913703093",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/a7306c2e-7742-4e11-a996-7f9876120643.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/222742ff-9c2a-47c5-9208-ef784c1ddb18.jpg",
				"steps": [
					{
						"content": "翅根剁块，葱姜切好备用。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/9963d652-8c10-4350-a7a5-b72e3e4901ae.jpg",
						"orderNum": 1
					},
					{
						"content": "榛蘑提前泡发，淘洗干净，攥干水分备用。（榛蘑和粉条我都是提前四个小时泡的）",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/5d263be5-de1a-442e-b9b5-e41fc512a024.jpg",
						"orderNum": 2
					},
					{
						"content": "粉条泡水。提前泡水，更容易炖熟，缩短烹饪时间。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/18ca98f6-193f-4c73-a647-b208502d0708.jpg",
						"orderNum": 3
					},
					{
						"content": "鸡块凉水下锅。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/89af47de-d5f4-4b67-9d39-a8c570c7378d.jpg",
						"orderNum": 4
					},
					{
						"content": "煮出血沫，去掉血沫。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/d19045d0-e2ea-480b-be91-a06e27d1cc35.jpg",
						"orderNum": 5
					},
					{
						"content": "捞出控水，备用。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/03481e17-d39d-4d1c-9852-e6789592d801.jpg",
						"orderNum": 6
					},
					{
						"content": "起锅烧油，放入葱姜爆香。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/94c609d8-c3c3-44ad-9431-68379b514bb1.jpg",
						"orderNum": 7
					},
					{
						"content": "加入榛蘑，十三香翻炒均匀。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/b8606e90-79e9-4702-ae4f-d26c3c34c4a2.jpg",
						"orderNum": 8
					},
					{
						"content": "加入鸡块，生抽继续翻炒出香味。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/be5aa1a1-4927-4124-94d5-c06a4fe88a0f.jpg",
						"orderNum": 9
					},
					{
						"content": "加水，没过菜品即可，加八角，干辣椒，盐，老抽。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/ce02a77c-9f33-41ad-8bd6-2674978b08e7.jpg",
						"orderNum": 10
					},
					{
						"content": "开锅后，下入粉条，一定像我这样，把粉条放在上面，如果粉条沉底，容易糊锅，小火慢炖，汤汁变少，粉条透明即可出锅。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/8f23ddea-d330-4620-978c-3e8e4b60a290.jpg",
						"orderNum": 11
					},
					{
						"content": "撒点葱花点缀一下，开吃。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/d2eb3f3a-6546-4b25-8611-b67b435c6afa.jpg",
						"orderNum": 12
					}
				],
				"tip": "",
				"type": "蔬菜水果 菌菇类 榛蘑",
				"type_v1": "蔬菜水果",
				"type_v2": "菌菇类",
				"type_v3": "榛蘑",
				"yl": [
					{
						"ylName": "鸡翅根",
						"ylUnit": "4个"
					},
					{
						"ylName": "榛蘑",
						"ylUnit": "适量"
					},
					{
						"ylName": "粉条",
						"ylUnit": "适量"
					},
					{
						"ylName": "八角",
						"ylUnit": "1个"
					},
					{
						"ylName": "干辣椒",
						"ylUnit": "2个"
					},
					{
						"ylName": "姜",
						"ylUnit": "4片"
					},
					{
						"ylName": "葱",
						"ylUnit": "半根"
					},
					{
						"ylName": "老抽",
						"ylUnit": "适量"
					},
					{
						"ylName": "生抽",
						"ylUnit": "适量"
					},
					{
						"ylName": "盐",
						"ylUnit": "适量"
					},
					{
						"ylName": "十三香",
						"ylUnit": "适量"
					}
				]
			},
			{
				"cpName": "猴头菇（银耳）圆肉乳鸽汤/二十四节气之大雪",
				"ct": "2019-12-07 23:30:50.175",
				"des": "“小雪封地，大雪封河”。大雪时节，万物生机潜藏，饮食方面可继续进补，以温阳养阴，填精滋血，补中气为要。在气温骤降没有供暖的江南地区，空调制热会使肺气遭受燥热损害，因此饮食也要清燥润肺和滋阴补肾转换交替。此款汤品，选择猴头菇、圆肉、乳鸽为食材。没有猴头菇，或者通风患者可选用银耳取代。猴头菇养补助消化，补气养阴，增强抵抗力。银耳性平味甘，滋阴润肺，养生津。两者皆有抑制肿瘤的作用。圆肉，安神补血。乳鸽滋润补血虚，养颜活血。合而为汤，补肺，理气养血。此款汤品。小与用蒸锅，同时做了两款，猴头菇的自己喝，银耳的小美喝，一起备料同时出品，精分高。",
				"id": "5debc5aae9b6cc6913703092",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/ee4f0a5a-5bfc-488b-b963-e9c8c2d11d9e.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/6e9b99f8-61af-49c0-b8f0-dbeaa0b0c0bb.jpg",
				"steps": [
					{
						"content": "准备食材。猴头菇和银耳的干货都需要提前一晚泡发，泡发后清洗干净。新鲜的猴头菇和银耳可以跳过这步。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/10e6c66f-6131-4b36-9e43-249477513fe5.jpg",
						"orderNum": 1
					},
					{
						"content": "猴头菇泡发时需要多次挤干水分，再用清水清洗几遍。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/d862800a-d9f4-41e6-9489-746ed93bc83d.jpg",
						"orderNum": 2
					},
					{
						"content": "去除根部，只留头部食用，否则汤会发苦。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/c8d27c0e-2e77-45d0-ae2c-e7b48b850643.jpg",
						"orderNum": 3
					},
					{
						"content": "将猴头菇和银耳撕成小朵。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/c0885205-3478-484d-9c4c-b6f5608e5076.jpg",
						"orderNum": 4
					},
					{
						"content": "圆肉稍稍浸泡，冲洗干净。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/96d13f94-1a60-4a9e-b2f2-56936009835e.jpg",
						"orderNum": 5
					},
					{
						"content": "乳鸽洗净。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/971ebe49-5899-4eb6-9253-20240ad2dc41.jpg",
						"orderNum": 6
					},
					{
						"content": "宰件。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/82f749ff-8eea-4241-891d-de03891d9318.jpg",
						"orderNum": 7
					},
					{
						"content": "两个炖盅内分别放入相应食材，加入水至炖盅盖以下。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/4c868abd-9282-4e16-a6fe-46929c2da53f.jpg",
						"orderNum": 8
					},
					{
						"content": "炖锅内注水至相应水位，放入炖盅，隔水炖2.5小时。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/a3022ff9-f67e-4bfe-b276-b74731bc7dc2.jpg",
						"orderNum": 9
					},
					{
						"content": "食用前加盐调味。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/3dfcb600-d980-4c3d-aa56-76ed123a1668.jpg",
						"orderNum": 10
					}
				],
				"tip": "",
				"type": "蔬菜水果 菌菇类 猴头菇",
				"type_v1": "蔬菜水果",
				"type_v2": "菌菇类",
				"type_v3": "猴头菇",
				"yl": [
					{
						"ylName": "猴头菇圆肉乳鸽汤",
						"ylUnit": ""
					},
					{
						"ylName": "鲜猴头菇",
						"ylUnit": "半个"
					},
					{
						"ylName": "圆肉",
						"ylUnit": "10克"
					},
					{
						"ylName": "鸽子",
						"ylUnit": "半只"
					},
					{
						"ylName": "生姜",
						"ylUnit": "1片"
					},
					{
						"ylName": "银耳圆肉乳鸽汤",
						"ylUnit": ""
					},
					{
						"ylName": "银耳",
						"ylUnit": "1/6朵"
					},
					{
						"ylName": "圆肉",
						"ylUnit": "10克"
					},
					{
						"ylName": "乳鸽",
						"ylUnit": "半只"
					},
					{
						"ylName": "生姜",
						"ylUnit": "1片"
					}
				]
			},
			{
				"cpName": "蟹味菇炖面",
				"ct": "2019-12-07 23:30:32.494",
				"des": "",
				"id": "5debc598e9b6cc6913703091",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/4d3d059c-58ea-4798-974b-3c478016bde7.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/08c10475-0bf5-4354-b357-af16bb639e4e.jpg",
				"steps": [
					{
						"content": "手擀面：适量蟹味菇：适量锅内花生油温热，放入两块冰糖融化，放适量葱花、姜片、蒜碎，随即倒入蟹味菇及胡萝卜片翻炒，待蟹味菇变色放入两勺蚝油，一勺生抽。翻炒片刻再入一碗凉水，煮开入面，出锅放少许鸡精、盐、香油、香菜碎即可，美味香鲜开吃",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/0ab7e885-4cc4-43d4-b25e-f19699934605.jpg",
						"orderNum": 1
					}
				],
				"tip": "",
				"type": "蔬菜水果 菌菇类 蟹味菇",
				"type_v1": "蔬菜水果",
				"type_v2": "菌菇类",
				"type_v3": "蟹味菇",
				"yl": [
					{
						"ylName": "蟹味菇",
						"ylUnit": "一把"
					}
				]
			},
			{
				"cpName": "草菇鸡蛋面",
				"ct": "2019-12-07 23:30:15.122",
				"des": "中医认为草菇性寒、味甘、微咸、无毒。草菇还能消食祛热，补脾益气，清暑热，滋阴壮阳，增加乳汁，防止坏血病，促进创伤愈合，护肝健胃，增强人体免疫力，是优良的食药兼用型的营养保健食品。生活中有很多的朋友由于身体的抵抗能力差，从而引发了贫血的症状，贫血的话容易引起头昏、眼花等多种症状，非常令人担心，其实我们日常饮食注意一下就能防治这种贫血，比如吃草菇就能达到这种效果，因为草菇中铁元素含量丰富，科技促进造血。",
				"id": "5debc587e9b6cc6913703090",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/783e9f95-acfe-4aff-8ce8-371e79e42c35.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/f5970e1e-0e50-440a-aa4e-521721c4f150.jpg",
				"steps": [
					{
						"content": "草菇/鸡蛋;",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/e28a1a8d-4c46-468b-b7a6-ac5740849c2a.jpg",
						"orderNum": 1
					},
					{
						"content": "草菇洗干净,切片备用;",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/bac1acc0-4512-49c2-ad85-8c9566ef5445.jpg",
						"orderNum": 2
					},
					{
						"content": "切点葱花备用;",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/7c7c324b-4767-4404-870d-88bb79c1905e.jpg",
						"orderNum": 3
					},
					{
						"content": "锅中加入油,油热后打入鸡蛋煎到表面凝固即可;",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/5ecae8b4-7275-4422-acdc-262c495b1737.jpg",
						"orderNum": 4
					},
					{
						"content": "鸡蛋盛出备用;",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/58adc6d8-4372-4c61-ad5f-0bd816eb6037.jpg",
						"orderNum": 5
					},
					{
						"content": "锅中倒入草菇,翻炒出香味;",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/5e7572bf-c7ed-408a-aa53-008c8827743d.jpg",
						"orderNum": 6
					},
					{
						"content": "加入适量的清水或开水煮沸;",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/09d2bcaa-9090-4004-9c0e-d9540b79124e.jpg",
						"orderNum": 7
					},
					{
						"content": "加入鸡蛋、面饼边煮边打散;",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/08ae5584-d113-45f4-b742-f3244b9e9360.jpg",
						"orderNum": 8
					},
					{
						"content": "盖上锅盖,小煮4-5分钟左右;",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/fbbbf94d-6eb5-40bf-9b08-8d63c7a57ff7.jpg",
						"orderNum": 9
					},
					{
						"content": "出锅前加入葱花,少许盐,酱油调味;",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/761d1350-be8d-43f2-91d0-046537bf565b.jpg",
						"orderNum": 10
					},
					{
						"content": "成品图",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/1c5589c3-178b-4e7b-ae69-9e643d29e49b.jpg",
						"orderNum": 11
					}
				],
				"tip": "",
				"type": "蔬菜水果 菌菇类 草菇",
				"type_v1": "蔬菜水果",
				"type_v2": "菌菇类",
				"type_v3": "草菇",
				"yl": [
					{
						"ylName": "鸡蛋",
						"ylUnit": "2个"
					},
					{
						"ylName": "草菇",
						"ylUnit": "2个"
					},
					{
						"ylName": "面",
						"ylUnit": "1块"
					},
					{
						"ylName": "葱",
						"ylUnit": "少许"
					},
					{
						"ylName": "盐",
						"ylUnit": "少许"
					},
					{
						"ylName": "花生油",
						"ylUnit": "少许"
					},
					{
						"ylName": "酱油",
						"ylUnit": "少许"
					},
					{
						"ylName": "清水",
						"ylUnit": "适量"
					}
				]
			},
			{
				"cpName": "红糖银耳汤",
				"ct": "2019-12-07 23:28:57.764",
				"des": "对女性来说，红糖更适合一些，所以舍弃用冰糖，颜色偏红。",
				"id": "5debc539e9b6cc691370308f",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/1f901371-c66a-4973-800c-113c48f1dcf7.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/486c28e5-a9af-48e5-8779-8dddac42908c.jpg",
				"steps": [
					{
						"content": "银耳去掉根部较硬部分，撕成小块，用凉水泡2小时。",
						"imgUrl": "",
						"orderNum": 1
					},
					{
						"content": "将泡好的银耳加适当凉水放入砂锅，煲2小时。",
						"imgUrl": "",
						"orderNum": 2
					},
					{
						"content": "加入红糖及红枣，继续煲2小时。",
						"imgUrl": "",
						"orderNum": 3
					},
					{
						"content": "关火，加入枸杞。",
						"imgUrl": "",
						"orderNum": 4
					}
				],
				"tip": "银耳先入锅能够煮出浓郁的粘稠感觉。",
				"type": "蔬菜水果 菌菇类 银耳",
				"type_v1": "蔬菜水果",
				"type_v2": "菌菇类",
				"type_v3": "银耳",
				"yl": [
					{
						"ylName": "银耳",
						"ylUnit": ""
					},
					{
						"ylName": "红糖",
						"ylUnit": ""
					},
					{
						"ylName": "枸杞",
						"ylUnit": ""
					},
					{
						"ylName": "红枣",
						"ylUnit": ""
					}
				]
			},
			{
				"cpName": "麻椒凉拌蒿子杆",
				"ct": "2019-12-07 23:27:27.696",
				"des": "既想吃得健康，又想解馋，怎么破？麻椒凉拌蒿子杆吃起来麻椒是本菜的点睛之笔，注意不是花椒、不是辣椒，是麻椒_",
				"id": "5debc4dfe9b6cc691370308e",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/935618fa-d9fa-4ba2-a9f2-c4e331bf3020.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/b48859a9-1443-4c30-b589-47457e5c1846.jpg",
				"steps": [
					{
						"content": "烧热水，水开后蒿子杆焯一下，再纯净水（冷水）静置（也可清蒿子杆，冷水）",
						"imgUrl": "",
						"orderNum": 1
					},
					{
						"content": "切葱蒜。小葱洗净切末，大蒜拍碎，剥开，切成蒜末。",
						"imgUrl": "",
						"orderNum": 2
					},
					{
						"content": "起锅热油。油温上来后放入麻椒。麻椒爆香后关火。用铲子剔出麻椒。放入葱蒜末，利用油的余温烫葱蒜，有“呲呲啦啦”之声。",
						"imgUrl": "",
						"orderNum": 3
					},
					{
						"content": "将锅中佐料四分之三倒入盘中，此刻放入日式酱油和寿司醋（放入家用酱油和醋亦可，寿司醋可在永辉超市购买，有果香）。",
						"imgUrl": "",
						"orderNum": 4
					},
					{
						"content": "冷却的蒿子杆捞出放入盘中（如果口味偏重，此时可适量加盐）。再将锅中余下的1/4佐料浇在顶端，再淋一点点酱油。完工。",
						"imgUrl": "",
						"orderNum": 5
					}
				],
				"tip": "选购蒿子杆时，尽量选购新鲜的；焯或蒸的时间莫太长，否则吃起来太老，影响口感。",
				"type": "蔬菜水果 叶类蔬菜 蒿子杆",
				"type_v1": "蔬菜水果",
				"type_v2": "叶类蔬菜",
				"type_v3": "蒿子杆",
				"yl": [
					{
						"ylName": "蒿子杆",
						"ylUnit": "1-2把"
					},
					{
						"ylName": "麻椒",
						"ylUnit": "8颗"
					},
					{
						"ylName": "小葱",
						"ylUnit": "1根"
					},
					{
						"ylName": "大蒜",
						"ylUnit": "5瓣"
					},
					{
						"ylName": "日式酱油",
						"ylUnit": "2-3勺"
					},
					{
						"ylName": "日式寿司醋",
						"ylUnit": "1-2勺"
					},
					{
						"ylName": "蒿子杆",
						"ylUnit": "把"
					}
				]
			},
			{
				"cpName": "蒜香豌豆尖",
				"ct": "2019-12-07 23:26:25.199",
				"des": "",
				"id": "5debc4a1e9b6cc691370308d",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/d9baff0c-b06b-467d-b9b9-47a99cda2fc0.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/cb6a68f5-1c0c-468c-be36-e9ca3d2d7446.jpg",
				"steps": [
					{
						"content": "洗干净豌豆苗",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/0a2e21b9-5c71-4271-886f-ad0063dfb172.jpg",
						"orderNum": 1
					},
					{
						"content": "油爆蒜片、辣椒圈、肥猪肉",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/4edeffb1-02e7-45da-b1ab-46a935b082c6.jpg",
						"orderNum": 2
					},
					{
						"content": "加入豌豆尖爆炒",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/6c9adaed-8126-4e48-9f28-86a502477ec4.jpg",
						"orderNum": 3
					},
					{
						"content": "好了",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/c9e41f75-2e13-4fab-b6cc-827774dcf0a1.jpg",
						"orderNum": 4
					}
				],
				"tip": "",
				"type": "蔬菜水果 叶类蔬菜 豌豆尖",
				"type_v1": "蔬菜水果",
				"type_v2": "叶类蔬菜",
				"type_v3": "豌豆尖",
				"yl": [
					{
						"ylName": "豌豆尖",
						"ylUnit": "1斤"
					},
					{
						"ylName": "肥猪肉",
						"ylUnit": "2块"
					},
					{
						"ylName": "蒜",
						"ylUnit": "2瓣"
					},
					{
						"ylName": "油",
						"ylUnit": "适量"
					},
					{
						"ylName": "盐",
						"ylUnit": "适量"
					},
					{
						"ylName": "辣椒片",
						"ylUnit": "2小圈"
					}
				]
			},
			{
				"cpName": "凉拌鱼腥草/凉拌折耳根",
				"ct": "2019-12-07 23:25:43.626",
				"des": "之前对香菜、香椿、鱼腥草等有浓烈特殊味道的菜完全不能接受，榴莲也是，谁想到，慢慢地也适应了，当成了美味。鱼腥草，家人原来避之唯恐不及，但是这次买了一丁点，试着认真拌了拌，他们也能尝几片了。糖的作用至关重要。",
				"id": "5debc477e9b6cc691370308c",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/b9d9bad1-136b-498c-b5c2-af695b91d553.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/664f0728-01e6-4615-9713-06511082b3ae.jpg",
				"steps": [
					{
						"content": "鱼腥草洗净。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/9ca05a54-9a6f-4b77-8b75-8ea494f8daa9.jpg",
						"orderNum": 1
					},
					{
						"content": "姜蒜辣椒和葱都切末放入小碗。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/6f594111-19c0-4ae4-a7a0-4a36c45085f2.jpg",
						"orderNum": 2
					},
					{
						"content": "加入一勺糖、两勺香醋、两勺生抽。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/e80cddff-8083-4b60-a366-dfa3f8842b83.jpg",
						"orderNum": 3
					},
					{
						"content": "搅匀使糖融化。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/4adb0d19-6d76-4aa4-97db-6c994a2a221d.jpg",
						"orderNum": 4
					},
					{
						"content": "鱼腥草略切段，放入大碗。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/fc03af0b-4a46-4a97-bde7-f776bcc5852f.jpg",
						"orderNum": 5
					},
					{
						"content": "将调料倒入盛鱼腥草的大碗中，淋上芝麻油。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/06de6703-8908-4b09-98f6-e27bb168e8c7.jpg",
						"orderNum": 6
					},
					{
						"content": "拌匀。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/9e437634-b979-40d1-8ad6-e83209d38ac7.jpg",
						"orderNum": 7
					},
					{
						"content": "装盘。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/0a8dce60-0e29-4cc9-b531-9de111b3e094.jpg",
						"orderNum": 8
					}
				],
				"tip": "",
				"type": "蔬菜水果 叶类蔬菜 鱼腥草",
				"type_v1": "蔬菜水果",
				"type_v2": "叶类蔬菜",
				"type_v3": "鱼腥草",
				"yl": [
					{
						"ylName": "鱼腥草",
						"ylUnit": "1小把"
					},
					{
						"ylName": "姜",
						"ylUnit": "3片"
					},
					{
						"ylName": "蒜",
						"ylUnit": "5瓣"
					},
					{
						"ylName": "朝天椒",
						"ylUnit": "3个"
					},
					{
						"ylName": "葱",
						"ylUnit": "1根"
					},
					{
						"ylName": "香醋",
						"ylUnit": "2勺"
					},
					{
						"ylName": "生抽",
						"ylUnit": "2勺"
					},
					{
						"ylName": "糖",
						"ylUnit": "1勺"
					},
					{
						"ylName": "芝麻油",
						"ylUnit": "2勺"
					}
				]
			},
			{
				"cpName": "豌豆苗苹果沙拉",
				"ct": "2019-12-07 23:25:21.712",
				"des": "我有点后悔咋没在大夏天里开发出来这道菜呢……我原本是最讨厌生吃豆苗的，可是这个做法让我重燃了生吃它的信心！",
				"id": "5debc461e9b6cc691370308b",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/eab1d201-08b0-4e9f-8bdd-c28c6079a04d.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/a504f376-7a80-4979-ba95-458e537b3e9d.jpg",
				"steps": [
					{
						"content": "豌豆苗纯净水洗净沥干，有这种混合苗就最好了",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/8d3ed63e-8d4c-49f4-88d2-95abb637f0cc.jpg",
						"orderNum": 1
					},
					{
						"content": "苹果切丝，我是刨的……",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/55825738-a85e-4eb6-9b4b-186d8df6516b.jpg",
						"orderNum": 2
					},
					{
						"content": "然后就爱放啥放啥。我就挤了点青金桔汁，淋了点橄榄油，放了几粒樱桃干，棒棒哒！",
						"imgUrl": "",
						"orderNum": 3
					}
				],
				"tip": "",
				"type": "蔬菜水果 叶类蔬菜 豌豆苗",
				"type_v1": "蔬菜水果",
				"type_v2": "叶类蔬菜",
				"type_v3": "豌豆苗",
				"yl": [
					{
						"ylName": "有机豌豆苗🌿",
						"ylUnit": "适量"
					},
					{
						"ylName": "有机红富士🍎",
						"ylUnit": "一个"
					},
					{
						"ylName": "枫糖浆",
						"ylUnit": "按需"
					},
					{
						"ylName": "橄榄油",
						"ylUnit": "适量"
					},
					{
						"ylName": "小青橘",
						"ylUnit": "一个"
					}
				]
			},
			{
				"cpName": "宵夜江湖中的韭黄猪肉锅贴，不错不错，可以收藏了",
				"ct": "2019-12-07 23:24:45.189",
				"des": "锅贴并没有想象中那么复杂…只需三步1，买食材，猪肉馅、饺子皮都可以买现成的2，拌馅，包锅贴3，煎锅贴",
				"id": "5debc43de9b6cc6913703089",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/9a5f4c89-f0c8-48d5-b543-03c8242fc9f9.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/fcc49c21-991a-4128-a019-26fcf4c4f505.jpg",
				"steps": [
					{
						"content": "准备食材1，饺子皮、猪肉馅买的现成的2，韭黄切碎3，葱姜切碎，越碎越好",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/f105cf1a-3da3-44c4-9091-0bbcde5a35ff.jpg",
						"orderNum": 1
					},
					{
						"content": "拌馅1，先拌肉馅，花生油烧热，随其他调味料一起放进去，根据个人口味调整放盐2，放入韭黄3，搅拌的时候一定要顺着一个方向搅",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/8349574c-21d7-4d89-8f10-5ff348234f66.jpg",
						"orderNum": 2
					},
					{
						"content": "包锅贴这个就不用说了吧，一看就会",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/d9fae92c-d431-4052-a32e-83b3323e978b.jpg",
						"orderNum": 3
					},
					{
						"content": "煎锅贴1，不粘锅放油〔不用放太多，薄薄一层就行，放入锅贴，煎到底部“固定成型”2，沿着锅的周围倒水〔水不能多放，多了就成煮饺子了，和锅贴底部持平即可，要盖锅盖！3，水干后再放一次水，这次水蒸发完了以后就熟了4，水分蒸发完以后，再煎一会，把底部煎脆。大功告成",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/dd419549-9ef6-4f46-be44-4627419a1b61.jpg",
						"orderNum": 4
					}
				],
				"tip": "",
				"type": "蔬菜水果 叶类蔬菜 韭黄",
				"type_v1": "蔬菜水果",
				"type_v2": "叶类蔬菜",
				"type_v3": "韭黄",
				"yl": [
					{
						"ylName": "饺子皮",
						"ylUnit": "俩人买的7两"
					},
					{
						"ylName": "韭黄",
						"ylUnit": "半斤"
					},
					{
						"ylName": "猪肉",
						"ylUnit": "俩人8两"
					},
					{
						"ylName": "鸡蛋",
						"ylUnit": "1个"
					},
					{
						"ylName": "盐",
						"ylUnit": "边尝边加"
					},
					{
						"ylName": "生抽",
						"ylUnit": "放点就行"
					},
					{
						"ylName": "料酒",
						"ylUnit": "放点就行"
					},
					{
						"ylName": "鸡精",
						"ylUnit": "放一点"
					},
					{
						"ylName": "葱，姜",
						"ylUnit": "放点就行"
					},
					{
						"ylName": "蚝油",
						"ylUnit": "放一点，调味"
					},
					{
						"ylName": "花生油，香油",
						"ylUnit": "拌馅用"
					}
				]
			},
			{
				"cpName": "韭黄煎鸡蛋",
				"ct": "2019-12-07 23:24:45.502",
				"des": "韭黄也叫黄韭、韭菜白，是韭菜在隔绝光线、完全黑暗中生长出来的，因此变成黄色。韭黄具有特殊的香气，也具有很好的功效。韭黄跟韭菜一样含有丰富的膳食纤维。这些粗纤维在人体能把肠胃中的头发、砂砾或金属屑等杂质包裹起来，随着大便排出体内，具有清肠通便和排毒的作用，对预防肠癌很有好处。",
				"id": "5debc43de9b6cc691370308a",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/f72efa97-1d12-4a65-a633-046a33617e28.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/cd69319e-ed09-4bdc-9ea5-a835d5d33e0d.jpg",
				"steps": [
					{
						"content": "把韭黄尾部坏的摘掉；",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/88b014b5-5e54-4d8d-81ad-762df5664d1b.jpg",
						"orderNum": 1
					},
					{
						"content": "放入淘米水浸泡片刻，清洗干净；",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/3eaaf5ec-7211-4d5b-9626-eb32cb7dd37a.jpg",
						"orderNum": 2
					},
					{
						"content": "韭黄切小段备用；",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/193b003b-0440-4aea-9f5c-3fb426e1e6bf.jpg",
						"orderNum": 3
					},
					{
						"content": "碗中打入两个鸡蛋，加少许盐用筷子打散搅拌均匀备用；",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/a4e6ba3e-6c1d-4a71-86f2-1cd65f350896.jpg",
						"orderNum": 4
					},
					{
						"content": "锅中热油加入韭黄大火翻炒；",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/b78934f0-6c2a-413c-8ce5-91fb5e24c0f7.jpg",
						"orderNum": 5
					},
					{
						"content": "韭黄炒到8成熟加入少许食用盐翻炒均匀；",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/60be4e2b-e0a2-47f2-a1cf-75acf00c7c38.jpg",
						"orderNum": 6
					},
					{
						"content": "倒入鸡蛋液；",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/87933e70-e2eb-4c4f-8d27-8d94d63f4898.jpg",
						"orderNum": 7
					},
					{
						"content": "盖上锅盖，关电，用余温把鸡蛋煎熟；",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/acf672e1-fc68-4285-8ee9-ec055eae769d.jpg",
						"orderNum": 8
					},
					{
						"content": "翻面煎一下出锅；",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/48665f91-0af9-44fd-808f-74d91433a884.jpg",
						"orderNum": 9
					},
					{
						"content": "成品图",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/c111cfe8-c809-45ed-b830-154529a95595.jpg",
						"orderNum": 10
					}
				],
				"tip": "",
				"type": "蔬菜水果 叶类蔬菜 韭黄",
				"type_v1": "蔬菜水果",
				"type_v2": "叶类蔬菜",
				"type_v3": "韭黄",
				"yl": [
					{
						"ylName": "韭黄",
						"ylUnit": "适量"
					},
					{
						"ylName": "鸡蛋",
						"ylUnit": "2个"
					},
					{
						"ylName": "花生油",
						"ylUnit": "少许"
					},
					{
						"ylName": "盐",
						"ylUnit": "少许"
					}
				]
			},
			{
				"cpName": "蒜蓉空心菜",
				"ct": "2019-12-07 23:23:39.200",
				"des": "广东人最爱吃的蒜蓉炒空心菜，我们那边叫这个菜为抽筋菜或者水菜，老人家说吃得多脚会抽筋的，哈哈还是看个人体质的，我吃了没有这个现象。",
				"id": "5debc3fbe9b6cc6913703088",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/b9c10776-947e-4a63-9096-3e6bfb0083f0.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/78272354-680c-4ec4-bb15-ed2f38dd68ff.jpg",
				"steps": [
					{
						"content": "水菜洗净备用",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/36623f49-d162-4081-bc48-5439ac721aca.jpg",
						"orderNum": 1
					},
					{
						"content": "腐乳和剁椒酱是这两个牌子的",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/a53ce423-c141-4322-9dec-3c2b778cf0c1.jpg",
						"orderNum": 2
					},
					{
						"content": "热油下锅放蒜蓉和剁椒酱爆香后放空心菜翻炒几下",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/51d3dea1-92ed-420e-85dc-d0406990ab23.jpg",
						"orderNum": 3
					},
					{
						"content": "差不多熟就放捣烂的腐乳翻炒均匀，待出盘时放点盐，鸡粉（清淡点的可不加）白糖，快速翻炒几下就可以出锅啦！",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/b1d586d4-7f16-487f-8822-5fb9f7678056.jpg",
						"orderNum": 4
					},
					{
						"content": "哈哈，完成啦，超好吃，想要辣一点的就放多点剁椒酱。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/e8b42921-da27-4415-998c-837353e2ad66.jpg",
						"orderNum": 5
					}
				],
				"tip": "",
				"type": "蔬菜水果 叶类蔬菜 空心菜",
				"type_v1": "蔬菜水果",
				"type_v2": "叶类蔬菜",
				"type_v3": "空心菜",
				"yl": [
					{
						"ylName": "空心菜",
						"ylUnit": "1斤"
					},
					{
						"ylName": "盐",
						"ylUnit": "适量"
					},
					{
						"ylName": "鸡粉",
						"ylUnit": "适量"
					},
					{
						"ylName": "白糖",
						"ylUnit": "适量"
					},
					{
						"ylName": "老干妈牌剁椒酱",
						"ylUnit": "1勺"
					},
					{
						"ylName": "腐乳",
						"ylUnit": "2块"
					},
					{
						"ylName": "蒜蓉",
						"ylUnit": "2粒"
					}
				]
			},
			{
				"cpName": "菠菜馅饼",
				"ct": "2019-12-07 23:21:52.055",
				"des": "菠菜茎叶柔软滑嫩、味美色鲜，丰富生素C、胡萝卜素、蛋白质，以及铁、钙、磷等矿质。除以鲜菜食用外，还可脱水制干和速冻。菠菜1、通肠导便、防治痔疮：菠菜，具促进肠道蠕动作用，利于排便，且能促进胰腺分泌，帮助消化。对于痔疮、慢性胰腺炎、便秘、肛裂等病症治疗作用；2、促进生长发育、增强抗病能力：菠菜胡萝卜素，在人体内转变成生素A，能护正常视力和上皮细胞健康，增加预防传染病能力，促进儿童生长发育。",
				"id": "5debc390e9b6cc6913703087",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/08f3ba6c-e67e-4cc7-9c1c-e381ca370515.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/472d2f79-ff8f-42bc-8f72-3b69c2ea7373.jpg",
				"steps": [
					{
						"content": "面粉用开水烫二分之一用筷子把所有面粉搅拌成絮状晾至不烫手少添加适量清水活成面团醒至20分钟",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/45601ea4-b061-4e41-a3b8-cac59fbd91bc.jpg",
						"orderNum": 1
					},
					{
						"content": "面条醒至微软光滑即可",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/38069814-035a-4d40-b744-2165257adc6d.jpg",
						"orderNum": 2
					},
					{
						"content": "准备原材料菠菜焯水后放入冷水过凉再沥干水份、泡发好的木耳，胡萝卜去皮、鸡蛋、磷虾备用",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/f7bbf478-e5b0-40c5-b46f-2aac25adcd6a.jpg",
						"orderNum": 3
					},
					{
						"content": "锅中倒入适量底油加热倒入蛋液",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/e69a753a-0259-4f08-b4c6-5947fdd80d00.jpg",
						"orderNum": 4
					},
					{
						"content": "鸡蛋炒至七分熟铲成小粒",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/05919a30-4c9c-420a-93e7-06fb0dbf9419.jpg",
						"orderNum": 5
					},
					{
						"content": "菠菜、胡萝卜、木耳小粒、磷虾、鸡蛋装入容器中",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/b1d1168d-a13b-42c4-a7ec-557508f49ab1.jpg",
						"orderNum": 6
					},
					{
						"content": "放调料盐、精、油、油",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/0671ecde-029a-49e1-8f08-98651911cc38.jpg",
						"orderNum": 7
					},
					{
						"content": "面团揉好切成小剂子擀成面皮将馅料放在面皮中间",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/33782492-9b29-407f-b929-57dbee50d16e.jpg",
						"orderNum": 8
					},
					{
						"content": "按照包包子的做法包好再用双手轻轻压扁不要用力过猛哦",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/df7bd6ab-1497-447d-8c71-c03081331a02.jpg",
						"orderNum": 9
					},
					{
						"content": "电饼铛涂一层薄薄的油依次把馅饼摆在锅中上下火加热5分钟",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/65803c21-851d-47fb-9d33-f0a4eaf4dd33.jpg",
						"orderNum": 10
					},
					{
						"content": "一面煎制成金黄色再翻过来煎另外一面两面都是金黄色即可",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/1d888025-2953-4e42-9fbd-b800391b89b9.jpg",
						"orderNum": 11
					},
					{
						"content": "香浓可口的菠菜馅饼就大功告成啦",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/4b96e544-bb3c-4854-9f0c-63a84b196252.jpg",
						"orderNum": 12
					},
					{
						"content": "搭配鸡蛋、米糊、水果c、小菜就是标配营养早餐",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/99ae7367-47aa-4e42-af9a-0d25c8758605.jpg",
						"orderNum": 13
					},
					{
						"content": "自己做的就是料足味鲜",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/478f4fe4-0947-4092-bda8-0465c769a366.jpg",
						"orderNum": 14
					},
					{
						"content": "这道美味方便快捷最主要经济实惠",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/935a2216-1a27-46d9-9b2b-61b8e4b4b7cf.jpg",
						"orderNum": 15
					},
					{
						"content": "开开心心快快乐乐的过好每一天",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/6c483d7a-fe46-43e2-8ca4-2933cacaadda.jpg",
						"orderNum": 16
					}
				],
				"tip": "菠菜茎叶柔软滑嫩、味美色鲜，丰富生素C、胡萝卜素、蛋白质，以及铁、钙、磷等矿质。除以鲜菜食用外，还可脱水制干和速冻。菠菜1、通肠导便、防治痔疮：菠菜，具促进肠道蠕动作用，利于排便，且能促进胰腺分泌，帮助消化。对于痔疮、慢性胰腺炎、便秘、肛裂等病症治疗作用；2、促进生长发育、增强抗病能力：菠菜胡萝卜素，在人体内转变成生素A，能护正常视力和上皮细胞健康，增加预防传染病能力，促进儿童生长发育。",
				"type": "蔬菜水果 叶类蔬菜 菠菜",
				"type_v1": "蔬菜水果",
				"type_v2": "叶类蔬菜",
				"type_v3": "菠菜",
				"yl": [
					{
						"ylName": "面粉",
						"ylUnit": "500克"
					},
					{
						"ylName": "菠菜",
						"ylUnit": "200克"
					},
					{
						"ylName": "鸡蛋",
						"ylUnit": "2个"
					},
					{
						"ylName": "胡萝卜",
						"ylUnit": "50克"
					},
					{
						"ylName": "木耳",
						"ylUnit": "50克"
					},
					{
						"ylName": "磷虾",
						"ylUnit": "50克"
					},
					{
						"ylName": "油",
						"ylUnit": "1勺"
					},
					{
						"ylName": "香油",
						"ylUnit": "0.5勺"
					},
					{
						"ylName": "盐",
						"ylUnit": "2匙"
					},
					{
						"ylName": "味精",
						"ylUnit": "0.2匙"
					}
				]
			},
			{
				"cpName": "鲜嫩韭菜煎鸡蛋",
				"ct": "2019-12-07 23:21:50.836",
				"des": "春天的韭菜鲜嫩无比赶快开始各种吃吧",
				"id": "5debc38ee9b6cc6913703086",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/3a6aea01-2206-4272-91a3-b7f55ae19680.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/577b622c-69f7-40f3-a38a-016949f11fcf.jpg",
				"steps": [
					{
						"content": "新鲜韭菜洗干净",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/05c5bfbe-c6a9-46c7-99d9-0802cdd5797c.jpg",
						"orderNum": 1
					},
					{
						"content": "切段备用",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/f7618625-49b8-48bb-b4b0-c6d539f436c5.jpg",
						"orderNum": 2
					},
					{
						"content": "土鸡蛋打入大碗中，洒一点点盐，加入料酒，朝一个方向充分打散。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/16b9bacb-203e-4f26-a3cb-32a98fd92db8.jpg",
						"orderNum": 3
					},
					{
						"content": "把韭菜放入碗里，加入蚝油，搅拌均匀。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/afe0aef8-4ee5-4dd0-89df-e36ea17c8f7b.jpg",
						"orderNum": 4
					},
					{
						"content": "不粘锅加入适量的植物油，烧热后，倒入鸡蛋韭菜糊，摊均匀。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/a97892dd-93e7-41b3-9e40-70731b84be8c.jpg",
						"orderNum": 5
					},
					{
						"content": "煎至焦黄后，翻面。如果韭菜比较多，摊得较厚，就从中间分开，继续煎至焦黄。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/f9cca634-7a05-441d-a261-36e9cc39c9e0.jpg",
						"orderNum": 6
					},
					{
						"content": "两面焦黄后就可以出锅喽！用千禧果装点一下，美美哒",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/9e13c6f5-9c61-4644-a6a1-f441e48f763a.jpg",
						"orderNum": 7
					},
					{
						"content": "简单的食材做出的美味，看上去很有食欲吧！",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/d562395b-a645-468d-b468-0faa0414c9ff.jpg",
						"orderNum": 8
					},
					{
						"content": "近照来一张",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/78715fe3-d7d7-4379-9aca-b42f1e576e75.jpg",
						"orderNum": 9
					}
				],
				"tip": "",
				"type": "蔬菜水果 叶类蔬菜 韭菜",
				"type_v1": "蔬菜水果",
				"type_v2": "叶类蔬菜",
				"type_v3": "韭菜",
				"yl": [
					{
						"ylName": "韭菜",
						"ylUnit": "小半把"
					},
					{
						"ylName": "土鸡蛋",
						"ylUnit": "4个"
					},
					{
						"ylName": "盐",
						"ylUnit": "一点点"
					},
					{
						"ylName": "蚝油",
						"ylUnit": "几滴"
					},
					{
						"ylName": "料酒",
						"ylUnit": "5克"
					},
					{
						"ylName": "千禧果",
						"ylUnit": "9个"
					}
				]
			},
			{
				"cpName": "蒸地瓜叶",
				"ct": "2019-12-07 23:18:44.099",
				"des": "",
				"id": "5debc2d4e9b6cc6913703085",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/512c96b1-92b3-4297-b552-6d121a0c6cb0.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/31e35086-c682-43e4-913f-59c206c7f14f.jpg",
				"steps": [
					{
						"content": "老家，现摘地瓜叶",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/88db7193-94d9-4a39-853e-e0134f6371c9.jpg",
						"orderNum": 1
					},
					{
						"content": "将地瓜叶洗净备用",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/bb5a79a7-eeb3-4052-9321-74703cababdf.jpg",
						"orderNum": 2
					},
					{
						"content": "将面粉，少量多次，搅拌",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/bb73a663-384f-4e57-af4d-5e049af705a8.jpg",
						"orderNum": 3
					},
					{
						"content": "搅拌好后，放到蒸锅里，下面铺好一层布",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/d67b45eb-4c9e-4806-accc-ac45f842cc43.jpg",
						"orderNum": 4
					},
					{
						"content": "有没有食欲，想不想行动？",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/1ba568b5-b727-46cf-b455-1d7d46ea4d6b.jpg",
						"orderNum": 5
					}
				],
				"tip": "",
				"type": "蔬菜水果 根茎蔬菜 红薯",
				"type_v1": "蔬菜水果",
				"type_v2": "根茎蔬菜",
				"type_v3": "红薯",
				"yl": [
					{
						"ylName": "地瓜叶",
						"ylUnit": "适量"
					},
					{
						"ylName": "面粉",
						"ylUnit": "适量"
					}
				]
			},
			{
				"cpName": "苹果红薯枸杞甜品",
				"ct": "2019-12-07 23:18:41.394",
				"des": "最近苹果比较多朋友还送来一袋甜甜的小红薯，加上起缘的有机大枸杞，补补[憨笑]一起炖个甜品吧",
				"id": "5debc2d1e9b6cc6913703084",
				"largeImg": "http://app2.showapi.com/img/caipu/20191207/1f05f1e6-6ec2-4a2f-9cf2-2a5b188f0e22.jpg",
				"smallImg": "http://app2.showapi.com/img/caipu/20191207/66a6f237-dfa9-4a9f-9df5-4f5410594929.jpg",
				"steps": [
					{
						"content": "切小块的红薯苹果加水冰糖，放入炖盅中，隔水炖约20分钟，加入起缘有机红枸杞（不用洗）再炖10分钟，就OK啦",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/1273cc88-1b26-4cfd-88ed-6ce6f3e397f6.jpg",
						"orderNum": 1
					},
					{
						"content": "不单单看着好看，吃着也香甜，不用加太多冰糖，一点点就OK啦，那三样炖品都较甜。",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/8e35f3de-489d-4bb9-b2a4-b6cb38ee7e96.jpg",
						"orderNum": 2
					},
					{
						"content": "",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/9eec0af2-c8a5-4e51-9aa4-b11cccc7535f.jpg",
						"orderNum": 3
					},
					{
						"content": "",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/4090c742-641e-4081-8760-d312766c6203.jpg",
						"orderNum": 4
					},
					{
						"content": "",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/836588b2-0532-4b19-a971-77f5171abbee.jpg",
						"orderNum": 5
					},
					{
						"content": "",
						"imgUrl": "http://app2.showapi.com/img/caipu/20191207/c47ed4fe-ffc9-4851-8932-83841836944e.jpg",
						"orderNum": 6
					}
				],
				"tip": "",
				"type": "蔬菜水果 根茎蔬菜 红薯",
				"type_v1": "蔬菜水果",
				"type_v2": "根茎蔬菜",
				"type_v3": "红薯",
				"yl": [
					{
						"ylName": "苹果",
						"ylUnit": "1个"
					},
					{
						"ylName": "红薯",
						"ylUnit": "2个小点的"
					},
					{
						"ylName": "起缘有机枸杞",
						"ylUnit": "20粒"
					},
					{
						"ylName": "冰糖",
						"ylUnit": "10克"
					}
				]
			}
		],
		"flag": true,
		"maxResult": 20,
		"msg": "查询成功！",
		"page": 1,
		"remark": "查询成功！",
		"ret_code": "0"
	}
}

const MenuCategory = {
    "showapi_res_error": "",
    "showapi_res_id": "2fb972bdc9744e268bb067f6b4edf268",
    "showapi_res_code": 0,
    "showapi_res_body": {
        "remark": "查询成功！",
        "ret_code": "0",
        "口味特色": {
            "口味": [
                "辣",
                "咖喱",
                "糖醋",
                "蒜香",
                "酸甜",
                "奶香",
                "孜然",
                "鱼香",
                "五香",
                "清淡"
            ],
            "器具": [
                "烤箱",
                "电饭煲",
                "微波炉",
                "平底锅",
                "塔吉锅"
            ],
            "异国风味": [
                "日式",
                "韩式",
                "西式",
                "西餐",
                "东南亚"
            ],
            "烹调方法": [
                "煎",
                "蒸",
                "炖",
                "红烧",
                "炸",
                "卤",
                "干锅",
                "火锅",
                "免烤"
            ]
        },
        "水产": {
            "虾": [
                "虾",
                "虾仁",
                "海米",
                "虾皮",
                "明虾",
                "基围虾",
                "龙虾",
                "小龙虾",
                "河虾",
                "海虾",
                "皮皮虾",
                "北极虾",
                "虾干",
                "青虾",
                "草虾",
                "海白虾",
                "虾米"
            ],
            "螃蟹": [
                "螃蟹",
                "梭子蟹",
                "大闸蟹",
                "蟹肉",
                "蟹黄"
            ],
            "贝": [
                "蛤蜊",
                "干贝",
                "鲍鱼",
                "扇贝",
                "牡蛎",
                "青口",
                "蛏子",
                "鲜贝",
                "北极贝",
                "河蚌"
            ],
            "鱼": [
                "鱼",
                "海水鱼",
                "淡水鱼",
                "鱼头",
                "鱼干",
                "鱼籽",
                "鱼肚"
            ]
        },
        "汤粥主食": {
            "三明治": [
                "三明治"
            ],
            "包子": [
                "包子"
            ],
            "汤羹": [
                "汤羹"
            ],
            "粥": [
                "粥"
            ],
            "面条": [
                "面条",
                "拌面",
                "炒面",
                "汤面",
                "凉面",
                "焖面"
            ],
            "饭": [
                "饭",
                "炒饭",
                "饭团",
                "盖浇饭",
                "煲仔饭",
                "焗饭",
                "烩饭"
            ],
            "饺子": [
                "饺子"
            ],
            "饼": [
                "饼"
            ],
            "馄饨": [
                "馄饨"
            ],
            "馒头": [
                "馒头"
            ]
        },
        "烘焙甜品饮料": {
            "烘焙": [
                "烘焙",
                "蛋糕",
                "面包",
                "饼干",
                "披萨",
                "派",
                "司康",
                "塔",
                "泡芙",
                "奶油霜"
            ],
            "甜品": [
                "甜品",
                "布丁",
                "冷饮",
                "果酱",
                "糖水",
                "冰淇淋",
                "果冻"
            ],
            "饮品": [
                "饮品",
                "咖啡",
                "豆浆",
                "奶茶",
                "酒",
                "果汁",
                "花草茶"
            ]
        },
        "热门专题": {
            "人群": [
                "儿童",
                "婴幼儿",
                "老人",
                "孕产妇",
                "宝宝食谱"
            ],
            "功效": [
                "减肥",
                "美容",
                "润肺抗燥",
                "补血",
                "清热祛火"
            ],
            "特殊场合": [
                "早餐",
                "下午茶",
                "便当",
                "圣诞节",
                "年夜饭",
                "深夜食堂",
                "情人节",
                "宵夜"
            ],
            "特色食品": [
                "小吃",
                "酱",
                "沙拉",
                "凉菜",
                "零食",
                "三明治",
                "月饼",
                "蒸蛋",
                "寿司",
                "粽子",
                "鸡蛋羹"
            ],
            "菜式": [
                "家常菜",
                "快手菜",
                "下饭菜",
                "素菜",
                "大鱼大肉",
                "下酒菜",
                "小清新",
                "创意菜"
            ],
            "视频专题": [
                "味蕾工坊"
            ]
        },
        "米面干果腌咸": {
            "干果类": [
                "芝麻",
                "花生",
                "杏仁",
                "红豆",
                "枣",
                "核桃",
                "板栗",
                "蔓越莓",
                "绿豆",
                "黄豆",
                "薏米",
                "葡萄干",
                "莲子",
                "橄榄",
                "黑豆",
                "蜜豆",
                "芸豆",
                "腰果",
                "桃胶",
                "乌梅",
                "松仁",
                "无花果",
                "银杏果",
                "话梅",
                "榛子",
                "鹰嘴豆",
                "罗汉果",
                "芡实",
                "开心果",
                "干山楂",
                "南瓜子",
                "瓜子仁",
                "眉豆",
                "红腰豆",
                "松子",
                "山楂干",
                "白果"
            ],
            "米面类": [
                "面粉",
                "面条",
                "大米",
                "高筋面粉",
                "意大利面",
                "糯米",
                "低筋面粉",
                "年糕",
                "西米",
                "糯米粉",
                "粉丝",
                "燕麦",
                "米粉",
                "酒酿",
                "燕麦片",
                "乌冬面",
                "小米",
                "玉米面",
                "全麦粉",
                "黑米",
                "魔芋",
                "方便面",
                "粉条",
                "米线",
                "荞麦面",
                "油条",
                "黄豆面",
                "消化饼干",
                "面筋",
                "粘米粉",
                "凉粉",
                "糙米",
                "河粉",
                "紫米",
                "烤麸",
                "小麦胚芽",
                "澄面",
                "粉皮",
                "蕨根粉",
                "藕粉",
                "红曲米",
                "莜面",
                "黄米",
                "荞麦",
                "大麦",
                "高粱米",
                "红米",
                "澄粉",
                "黄豆粉"
            ],
            "腌咸制品": [
                "火腿",
                "香肠",
                "培根",
                "腊肉",
                "酸菜",
                "泡菜",
                "肉松",
                "梅干菜",
                "雪里蕻",
                "榨菜",
                "辣白菜",
                "笋干",
                "鱼丸",
                "橄榄菜",
                "咸菜",
                "萝卜干",
                "咸肉",
                "酸豇豆",
                "肉丸",
                "午餐肉",
                "蟹棒",
                "叉烧肉",
                "芽菜",
                "纳豆",
                "大头菜",
                "酸笋",
                "木鱼花",
                "冬菜",
                "玉兰片",
                "泡萝卜",
                "咸黄瓜",
                "叉烧",
                "酸豆角"
            ]
        },
        "肉类": {
            "兔肉": [
                "兔肉"
            ],
            "火鸡": [
                "火鸡"
            ],
            "牛": [
                "牛",
                "牛肉",
                "牛腩",
                "牛排",
                "肥牛",
                "牛里脊",
                "牛腱",
                "牛尾",
                "牛肉末",
                "牛筋",
                "牛百叶",
                "牛骨",
                "牛肉馅"
            ],
            "牛蛙": [
                "牛蛙"
            ],
            "猪": [
                "猪",
                "猪肉",
                "排骨",
                "猪肉末",
                "五花肉",
                "猪蹄",
                "瘦肉",
                "里脊",
                "猪肝",
                "猪排",
                "猪肚",
                "猪皮",
                "猪骨",
                "肥肠",
                "猪油",
                "猪腰",
                "猪耳朵",
                "猪心",
                "猪血",
                "猪肺",
                "肉末"
            ],
            "田鸡": [
                "田鸡"
            ],
            "羊": [
                "羊",
                "羊肉",
                "羊排",
                "羊腿",
                "羊肉片",
                "羊蝎子"
            ],
            "雪蛤": [
                "雪蛤"
            ],
            "驴肉": [
                "驴肉"
            ],
            "鸡": [
                "鸡",
                "鸡翅",
                "鸡胸",
                "鸡腿",
                "鸡爪",
                "鸡肉",
                "乌鸡",
                "鸡胗",
                "土鸡",
                "仔鸡",
                "三黄鸡",
                "鸡肝",
                "老母鸡",
                "鸡心",
                "柴鸡",
                "童子鸡"
            ],
            "鸭": [
                "鸭",
                "鸭腿",
                "鸭肉",
                "老鸭",
                "鸭胗",
                "鸭血",
                "鸭掌",
                "鸭翅",
                "鸭舌",
                "鸭肠",
                "鸭脖",
                "鸭肝",
                "鸭爪"
            ],
            "鸽子": [
                "鸽子"
            ],
            "鹅": [
                "鹅"
            ],
            "鹌鹑": [
                "鹌鹑"
            ],
            "鹿肉": [
                "鹿肉"
            ]
        },
        "蔬菜水果": {
            "叶类蔬菜": [
                "芹菜",
                "白菜",
                "韭菜",
                "菠菜",
                "西兰花",
                "圆白菜",
                "花椰菜",
                "莴苣",
                "青菜",
                "娃娃菜",
                "生菜",
                "甘蓝",
                "蒜薹",
                "紫甘蓝",
                "空心菜",
                "油菜",
                "荠菜",
                "香椿",
                "茼蒿",
                "菜心",
                "芥兰",
                "黄花菜",
                "韭黄",
                "苋菜",
                "紫苏",
                "芥菜",
                "油麦菜",
                "豌豆苗",
                "苦菊",
                "青蒜",
                "鱼腥草",
                "马兰",
                "蕨菜",
                "西洋菜",
                "水芹",
                "儿菜",
                "豌豆尖",
                "芝麻菜",
                "芦蒿",
                "穿心莲",
                "孢子甘蓝",
                "萝卜苗",
                "红菜苔",
                "牛至",
                "蒿子杆",
                "包菜",
                "莴笋",
                "花菜",
                "蒜苔",
                "豆苗",
                "披萨草"
            ],
            "果实类蔬菜": [
                "彩椒",
                "番茄",
                "南瓜",
                "玉米",
                "茄子",
                "黄瓜",
                "豇豆",
                "青椒",
                "苦瓜",
                "冬瓜",
                "丝瓜",
                "秋葵",
                "西葫芦",
                "毛豆",
                "豌豆",
                "四季豆",
                "荷兰豆",
                "蚕豆",
                "圣女果",
                "扁豆",
                "刀豆",
                "瓠瓜",
                "玉米笋",
                "西红柿"
            ],
            "根茎蔬菜": [
                "土豆",
                "萝卜",
                "紫薯",
                "红薯",
                "胡萝卜",
                "山药",
                "藕",
                "芋头",
                "笋",
                "茭白",
                "马蹄",
                "牛蒡",
                "菱角"
            ],
            "水果": [
                "水果",
                "时令水果",
                "柠檬",
                "椰子",
                "草莓",
                "橙",
                "牛油果",
                "木瓜",
                "山楂",
                "蓝莓",
                "西瓜",
                "柚子",
                "火龙果",
                "樱桃",
                "榴莲",
                "西柚",
                "桃",
                "葡萄",
                "金橘",
                "黄桃",
                "百香果",
                "杨梅",
                "桔子",
                "荔枝",
                "无花果",
                "石榴",
                "杏子",
                "桑葚",
                "哈密瓜",
                "柿子",
                "李子",
                "青梅",
                "枇杷",
                "香瓜",
                "甘蔗",
                "覆盆子",
                "杨桃",
                "橘子",
                "金桔",
                "杏"
            ],
            "花朵植物类": [
                "茶叶",
                "桂花",
                "玫瑰",
                "薄荷",
                "菊花",
                "洛神花",
                "茉莉花",
                "槐花",
                "金银花"
            ],
            "菌菇类": [
                "香菇",
                "杏鲍菇",
                "银耳",
                "木耳",
                "金针菇",
                "蘑菇",
                "茶树菇",
                "平菇",
                "松茸",
                "鸡腿菇",
                "草菇",
                "竹荪",
                "蟹味菇",
                "花菇",
                "猴头菇",
                "牛肝菌",
                "灵芝",
                "榛蘑",
                "白玉菇",
                "姬松茸",
                "滑子菇",
                "发菜",
                "白灵菇",
                "袖珍菇",
                "双孢菇",
                "秀珍菇"
            ]
        },
        "蛋奶豆制品": {
            "奶制品": [
                "牛奶",
                "黄油",
                "巧克力",
                "奶油",
                "奶酪",
                "酸奶",
                "黑巧克力",
                "淡奶油",
                "奶油奶酪",
                "炼乳",
                "奶粉",
                "马苏里拉奶酪",
                "白巧克力",
                "酸奶油",
                "酥油",
                "芝士"
            ],
            "蛋类": [
                "鸡蛋",
                "咸蛋",
                "皮蛋",
                "鹌鹑蛋",
                "鸭蛋",
                "咸鸭蛋"
            ],
            "豆制品": [
                "豆腐",
                "香干",
                "豆渣",
                "千张",
                "腐竹",
                "素鸡",
                "油豆皮",
                "豆干",
                "豆腐皮"
            ]
        }
    }
}

const MenuDetail = {
    "showapi_res_error": "",
    "showapi_res_id": "4fd28576296043238b14952dee3b83a4",
    "showapi_res_code": 0,
    "showapi_res_body": {
        "allNum": 1,
        "allPage": 1,
        "datas": [
            {
                "cpName": "黄金鸡蛋盅",
                "ct": "2019-01-15 23:35:59.867",
                "des": "这道菜味道清淡，色彩艳丽，非常适合家有宝宝的朋友",
                "id": "5c3dfddfe9b6cc65afc9427e",
                "largeImg": "http://app2.showapi.com/img/caipu/20190115/9bfade52-1f16-451a-8d0e-9827a514f552.jpg",
                "smallImg": "http://app2.showapi.com/img/caipu/20190115/e16ed02f-acd4-457c-930b-0f28c2535717.jpg",
                "steps": [
                    {
                        "content": "鲜虾去虾线，选个头适量的贝贝南瓜",
                        "imgUrl": "http://app2.showapi.com/img/caipu/20190115/08e376ba-4c49-47e7-8400-bcdf557185d1.jpg",
                        "orderNum": 1
                    },
                    {
                        "content": "把南瓜去盖，去瓤，准备代用",
                        "imgUrl": "http://app2.showapi.com/img/caipu/20190115/4cae16f5-7057-4ddd-a0fe-38e4c4087fc5.jpg",
                        "orderNum": 2
                    },
                    {
                        "content": "先把南瓜放电饭锅蒸5分钟，蒸到5分熟",
                        "imgUrl": "http://app2.showapi.com/img/caipu/20190115/561b3ebd-5143-46cf-bdfe-5eaabb2a8476.jpg",
                        "orderNum": 3
                    },
                    {
                        "content": "十分钟后把虾仁和鸡蛋的调和液倒入南瓜盅，继续蒸5分钟",
                        "imgUrl": "http://app2.showapi.com/img/caipu/20190115/0ea331db-348e-4745-b28a-050624c3247b.jpg",
                        "orderNum": 4
                    },
                    {
                        "content": "因为我选的贝贝南瓜个头小了点，所以时间蒸长了点，就有点过了",
                        "imgUrl": "http://app2.showapi.com/img/caipu/20190115/c71adc1a-432e-478e-a447-26e6aa7e0d99.jpg",
                        "orderNum": 5
                    }
                ],
                "tip": "1、不要担心南瓜蒸不熟，其实南瓜是很好蒸熟的，10分钟差不多就够了2、一定要选贝贝南瓜，就是俗称的板栗南瓜，口感和普通南瓜有点区别更面一些",
                "type": "蛋奶豆制品 蛋类 鸡蛋",
                "type_v1": "蛋奶豆制品",
                "type_v2": "蛋类",
                "type_v3": "鸡蛋",
                "yl": [
                    {
                        "ylName": "鸡蛋",
                        "ylUnit": "2个"
                    },
                    {
                        "ylName": "贝贝南瓜",
                        "ylUnit": "1"
                    },
                    {
                        "ylName": "虾仁",
                        "ylUnit": "适量"
                    },
                    {
                        "ylName": "日本蘸料",
                        "ylUnit": "一小勺"
                    }
                ]
            }
        ],
        "flag": true,
        "maxResult": 20,
        "msg": "查询成功！",
        "page": 1,
        "remark": "查询成功！",
        "ret_code": "0"
    }
}

export MenuList
export MenuCategory
export MenuDetail